<?php

namespace App\Console\Commands;

use Illuminate\Console\Command;
use App\Models\Student;
use App\Models\Course;

class ImportStudentsFromCsv extends Command
{
    protected $signature = 'students:import';
    protected $description = 'استيراد طلبة مساعد معالج حضوري';

    public function handle()
    {
      // البحث بالاسم والنمط معاً لكي لا يختلط الحضوري مع عن بعد
        $course = Course::firstOrCreate(
            [
                'name'          => 'مساعد معالج',
                'training_mode' => 'حضوري', // أو presential حسب المتوفر لديك
            ],
            [
                'monthly_fee'   => 800,
                'price'         => 800,
            ]
        );

        // 2. لائحة الطلبة المستخرجة من الإكسيل
        $studentsData = [
            // فوج G1A/26
            ['MA2027658365', 'NOUHAILA', 'MEROUANE', 'AE323319', '0632740514', 'G1A/26', '2026-06-14', 1000, '2026-10-27', 0, null],
            ['MA2027658366', 'SALMA', 'GAMRI', 'TA159815', '0619274437', 'G1A/26', '2026-06-15', 1000, '2026-10-13', 0, null],
            ['MA2027658367', 'AMAL', 'HADDAOUI', 'ID147196', '0712074693', 'G1A/26', '2026-06-18', 1000, '2026-10-13', 0, null],
            ['MA2027658368', 'OUAHIBA', 'LFITASS', 'TA170411', '0725232026', 'G1A/26', '2026-06-23', 1000, '2026-07-25', 0, null],
            ['MA2027658370', 'NAIMA', 'ZOUAIRI', 'X355616', '0640886303', 'G1A/26', '2026-07-04', 1000, '2026-10-13', 0, null],
            ['MA2027658371', 'NOHAYLA', 'NMILA', 'AD350875', '0603256575', 'G1A/26', '2026-07-05', 800, '2026-10-27', 0, null],
            ['MA2027658372', 'ZINEB', 'WAZARI', 'BK765640', '0693499917', 'G1A/26', '2026-07-19', 1000, '2026-10-13', 0, null],
            ['MA2027658373', 'WATIFA', 'EL-MARJI', 'ZT99584', '0717991164', 'G1A/26', '2026-07-22', 1000, '2026-10-27', 0, null],
            ['MA2027658374', 'KENZA', 'ECHCHBOUKY', 'TK40091', '0640478183', 'G1A/26', '2026-08-03', 1000, '2026-10-20', 0, null],
            ['MA2027658375', 'AHLAM', 'NAZIH', 'AD377272', '0720553585', 'G1A/26', '2026-08-06', 1000, '2026-10-20', 0, null],
            ['MA2027658376', 'MERYEM', 'EL MAMERI', 'AM22634', '0712475915', 'G1A/26', '2026-09-16', 1000, '2026-10-15', 0, null],
            ['MA2027658377', 'OUMAIMA', 'BOUKHAL', 'AE138489', '0656481886', 'G1A/26', '2026-08-14', 1000, '2026-10-15', 0, null],
            ['MA2027658378', 'MADIHA', 'DOUIDA', 'CB222103', '0705077002', 'G1A/26', '2026-08-19', 1000, '2026-10-20', 0, null],
            ['MA2027658379', 'FATIMA ZAHRA', 'ECH-CHARTY', 'AM19381', '0616777388', 'G1A/26', '2026-09-20', 800, '2026-10-15', 0, null],
            ['MA2027658380', 'DOUAE', 'EL YOUNSSI', 'AD389305', '0707852394', 'G1A/26', '2026-08-31', 1000, '2026-10-27', 0, null],
            ['MA2027658381', 'FARAH', 'AALLOU', 'VM22333', '0657926532', 'G1A/26', '2026-09-03', 1000, '2026-10-15', 0, null],
            ['MA2027658382', 'OMAR', 'BEN HAJJI', 'AC2502', '0669004101', 'G1A/26', '2026-09-04', 1000, '2026-10-17', 0, null],
            ['MA2027658383', 'HANAE', 'ENNIRI', 'AD138036', '0671947919', 'G1A/26', '2026-09-05', 1000, '2026-10-05', 0, null],
            ['MA2027658384', 'SALMA', 'ABROUD', 'AE361798', '0637773406', 'G1A/26', '2026-09-07', 300, '2026-10-13', 0, null],
            ['MA2027658385', 'HOUDA', 'EL AHRACHE', 'AE342345', '0656744530', 'G1A/26', '2026-07-18', 700, '2026-10-13', 0, null],
            ['MA2027658386', 'GHITA', 'BENADADA', 'BF10191', '0704197465', 'G1A/26', '2026-09-11', 700, '2026-10-15', 0, null],
            ['MA2027658387', 'DOUNIA', 'EL RHAZOUANI', 'AA120779', '0618818590', 'G1A/26', '2026-09-15', 1000, '2026-10-15', 0, null],
            ['MA2027658388', 'ILYAS', 'LACHHAB', 'L752607', '0719983447', 'G1A/26', '2026-09-19', 1000, '2026-10-20', 0, null],
            ['MA2027658389', 'SALMA', 'AZZOUZI', 'AD340596', '0717559067', 'G1A/26', '2026-09-22', 1000, '2026-09-15', 0, null],
            ['MA2027658390', 'FATIMA ZAHRA', 'MARAOUCH', 'AA38173', '0672603050', 'G1A/26', '2026-09-23', 1000, '2026-09-23', 0, null],
            ['MA2027658391', 'ZAHIA', 'CHAMESSI', 'AE80550', '0770124496', 'G1A/26', '2026-09-24', 1000, '2026-09-15', 0, null],
            ['MA2027_27', 'CHADIA', 'TALAACHIRT', 'AE70476', '0645972159', 'G1A/26', '2026-09-29', 1000, '2026-10-29', 0, null],
            ['MA2027_28', 'JIHANE', 'LABIAD', 'Z711752', '0631122978', 'G1A/26', '2026-09-29', 1000, '2026-10-29', 0, null],
            ['MA2027_29', 'SAFAE', 'MOUNIR', 'AI536', '0763588387', 'G1A/26', '2026-09-29', 700, '2026-09-15', 0, null],
            ['MA2027_30', 'ABDELHAY', 'BASSAID', 'PB251545', '0679499215', 'G1A/26', '2026-10-02', 1000, '2026-11-02', 0, null],

            // فوج G1B/26
            ['MA2027658392', 'NOURA', 'ELAMRANI', 'AY44839', '0693222629', 'G1B/26', '2026-08-01', 1000, '2026-09-15', 1, 'غادر حسب سجل إكسيل'],
            ['MA2027658393', 'FATIMA EZZAHRAE', 'BOUTAHER', 'AE334057', '0609577547', 'G1B/26', '2026-08-03', 1000, '2026-10-15', 0, null],
            ['MA2027658394', 'OUASSILA', 'EL ALLAMIA', 'GN257056', '0679085368', 'G1B/26', '2026-08-01', 1000, '2026-10-12', 0, null],
            ['MA2027658395', 'FADOUA', 'EL HAMDAOUI', 'A747022', '0611269192', 'G1B/26', '2026-08-08', 500, '2026-09-08', 0, null],
            ['MA2027658396', 'KHADIJA', 'AYOUB', 'X477512', '0619602939', 'G1B/26', '2026-08-19', 1000, '2026-10-19', 0, null],
            ['MA2027658397', 'HIND', 'EL FAJRI', 'A711703', '0642416613', 'G1B/26', '2026-08-21', 1000, '2026-09-21', 0, null],
            ['MA2027658398', 'HIBA', 'FELLANI', 'UC166601', '0674732410', 'G1B/26', '2026-08-21', 1000, '2026-10-12', 0, null],
            ['MA2027658399', 'HIBA', 'OUIT', 'AD359929', '0660446287', 'G1B/26', '2026-08-24', 1000, '2026-09-15', 0, null],
            ['MA2027658400', 'FOUZIA', 'EL MZABI', 'AB117216', '0606722458', 'G1B/26', '2026-08-21', 1000, '2026-10-19', 0, null],
            ['MA2027658401', 'OUAFA', 'KERROUM', 'PA274569', '0606856919', 'G1B/26', '2026-08-24', 1000, '2026-10-15', 0, null],
            ['MA2027658402', 'ILHAM', 'DAOUDI', 'AG3316', '0616503835', 'G1B/26', '2026-09-01', 1000, '2026-10-26', 0, null],
            ['MA2027658403', 'HIND', 'BAROUAL', 'AM23517', '0627649532', 'G1B/26', '2026-09-01', 1000, '2026-10-26', 0, null],
            ['MA2027658404', 'DOUAA', 'LAHBICHI', 'AD383792', '0779169686', 'G1B/26', '2026-09-02', 1000, '2026-10-02', 0, null],
            ['MA2027658405', 'SARA', 'SAMALI', 'TA174443', '0637709847', 'G1B/26', '2026-07-31', 500, '2026-09-27', 0, null],
            ['MA2027658406', 'DOUAE', 'CHERAJ', 'XA166105', '0785638213', 'G1B/26', '2026-09-07', 1000, '2026-10-07', 0, null],
            ['MA2027658407', 'WAFAA', 'EL KHAL', 'BE802721', '0649250720', 'G1B/26', '2026-09-08', 900, '2026-09-15', 0, null],
            ['MA2027658408', 'FATIMA ZAHRA', 'ZAROU', 'AD330929', '0606573429', 'G1B/26', '2026-09-12', 1000, '2026-10-19', 0, null],
            ['MA2027658409', 'LOUBNA', 'BYDAR', 'AM1293', '0624101146', 'G1B/26', '2026-09-12', 1000, '2026-10-19', 0, null],
            ['MA2027658410', 'MALAK', 'ELKINANY', 'AM25753', '0687501025', 'G1B/26', '2026-09-01', 0, '2026-10-19', 0, null],
            ['MA2027658411', 'SARA', 'BENSAID', null, '0708400862', 'G1B/26', '2026-06-21', 1000, '2026-10-21', 0, null],
        ];
$count = 0;
        foreach ($studentsData as $row) {
            Student::updateOrCreate(
                ['registration_number' => $row[0]],
                [
                    'first_name'            => $row[1],
                    'last_name'             => $row[2],
                    'cin'                   => $row[3],
                    'phone'                 => $row[4],
                    'course_id'             => $course->id,
                    'group_name'            => $row[5],
                    'training_mode'         => 'حضوري', // تم التغيير إلى 'حضوري' لتطابق نوع العمود في الداتابيز
                    'registration_date'     => $row[6],
                    'registration_fee_paid' => $row[7],
                    'next_payment_date'     => $row[8],
                    'is_quitted'            => $row[9],
                    'quit_reason'           => $row[10],
                ]
            );
            $count++;
        }

        $this->info("تم استيراد {$count} طالباً بنجاح في تخصص مساعد معالج (حضوري)!");
        return 0;
    }
}